In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from common import get_data

/Users/tanmayk/.pyenv/versions/3.9.1/envs/SLM-Code/lib/python3.9/site-packages/pandas/compat/__init__.py:124: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [4]:
training_data = get_data('data/train_selected.csv')
test_data = get_data('data/test_selected_ttf.csv')

In [5]:
training_data.head()

   id  cycle       s1      s2     s3      s4  ttf  label_bnc
0   1      1  1400.60  554.36  47.47  521.66  191          0
1   1      2  1403.14  553.75  47.49  522.28  190          0
2   1      3  1404.20  554.26  47.27  522.42  189          0
3   1      4  1401.87  554.45  47.13  522.86  188          0
4   1      5  1406.22  554.00  47.28  522.19  187          0

In [6]:
test_data.head()

   id  cycle       s1      s2     s3      s4  ttf  label_bnc
0   1     31  1398.91  554.42  47.23  521.79  112          0
1   2     49  1410.83  553.52  47.67  521.74   98          0
2   3    126  1418.89  552.59  47.88  520.83   69          0
3   4    106  1406.88  552.64  47.65  521.88   82          0
4   5     98  1419.36  553.29  47.46  521.00   91          0

In [7]:
# Find the number of rows and columns in the training data
training_data.shape

(20631, 8)

In [8]:
# Find the number of rows and columns in the test data
test_data.shape

(100, 8)

# Prepare the training data for modeling

In [9]:
columns = ['ID', 'Cycle', 'S1', 'S2', 'S3', 'S4', 'TTF', 'TTF_LABEL']
training_data.columns = columns

In [10]:
# Save training data to csv
training_data.to_csv('data/train_base.csv', index=False)

# Prepare the testing data for modeling

In [11]:
test_data.head()

   id  cycle       s1      s2     s3      s4  ttf  label_bnc
0   1     31  1398.91  554.42  47.23  521.79  112          0
1   2     49  1410.83  553.52  47.67  521.74   98          0
2   3    126  1418.89  552.59  47.88  520.83   69          0
3   4    106  1406.88  552.64  47.65  521.88   82          0
4   5     98  1419.36  553.29  47.46  521.00   91          0

In [12]:
test_data.label_bnc.value_counts()

0    75
1    25
Name: label_bnc, dtype: int64

In [13]:
# Update column names
test_data.columns = columns

In [14]:
test_data.head()

   ID  Cycle       S1      S2     S3      S4  TTF  TTF_LABEL
0   1     31  1398.91  554.42  47.23  521.79  112          0
1   2     49  1410.83  553.52  47.67  521.74   98          0
2   3    126  1418.89  552.59  47.88  520.83   69          0
3   4    106  1406.88  552.64  47.65  521.88   82          0
4   5     98  1419.36  553.29  47.46  521.00   91          0

In [15]:
# Save test data to csv
test_data.to_csv('data/test_base.csv', index=False)